{
    "headers": [
        "Education",
        "Research Interests and Activities",
        "Recent and Forthcoming Publications",
        "Recent Courses",
        "Selected Courses",
        "Education",
        "Courses",
        "Course Taught",
        "Courses",
        "If you interested in conducting research in my lab see details below",
        "My research interests lie in understanding protein signaling specificity and how developmental processes evolve.  If you interested in conducting research in my lab see details below",
        "Research Interests",
        "If you are interested in conducting research in my lab, then please click below",
        "If you interested in conducting research in my lab see details below",
        "Degrees",
        "Research",
        "Degrees",
        "In our lab we are currently pursuing the following  research projects",
        "External Grants and AWARDS",
        "Recent Courses",
        "Past Courses",
        "Recent publications",
        "Grants",
        "Awards",
        "Students Used to Jot Down Quotes",
        "Saving the Helpless Invertebrates of Topsoil",
        "Every Year I Intend to Find New Ones; Every Year I Fail",
        "Office hours for 24-25 FA",
        "Currently teaching",
        "Previous Courses",
        "Courses Taught",
        "Recent Publications",
        "Select Presentations",
        "Event Production",
        "Research Interests",
        "Teaching Interests",
        "Selected Publications",
        "Recent Publications",
        "Courses",
        "FALL '24 OFFICE HOURS",
        "Recent Publications",
        "Recent digital publications, book reviews, and public writing",
        "Courses Offered",
        "Courses",
        "Selected Publications",
        "Internet Resources",
        "Courses Taught",
        "Final Projects for the 2011 Summer \"Girlstories\" class can be accessed at the following addresses",
        "Other interests",
        "Publications",
        "Public Writing",
        "Courses Taught",
        "Recent projects include",
        "Regular Course Offerings",
        "COURSES I TEACH",
        "MY RESEARCH",
        "Fall 2024 courses",
        "Brief List of activities/accomplishments",
        "I taught Mathematics at Ithaca College for about 33 years.  These are some of the highlights of my work",
        "Degrees",
        "Research interests",
        "Teaching interests",
        "Some of the courses I have taught include",
        "Selected Publications",
        "Texts",
        "Peer-reviewed book and journal articles",
        "Sample Courses",
        "Degrees",
        "Fall 2020 courses",
        "Other semesters",
        "My most recent publications (https//orcid.org/0000-0003-1972-2022)",
        "One book project, Quakers, Race, and Empire:  Political Ecumenism and U.S. Insular Policy in the Early Twentieth Century, shows how and why progressive era Quakers intervened in U.S. insular policy discourses over the organizing and governance of acquired territories (Puerto Rico and the Philippines), and the struggles for self-determination, and citizenship within the context of an expanding American empire from 1898 to 1917.  For some aspects of this book's arguments, please see",
        "Quoted in various places related to U.S. politics, race, class, and citizenship",
        "Please read my critical commentary here",
        "Please follow me and read my research here",
        "USEFUL WEBSITES",
        "What I have read or am reading this summer (2024)",
        "For some of my newest writing see",
        "Degrees",
        "Research Interests",
        "Teaching Interests",
        "Selective Publications",
        "I have taught at Ithaca College since 2012. I teach many counseling courses, as well as some core required courses for our Psychology majors. Some of these courses are listed below",
        "Education",
        "Degrees",
        "Degrees",
        "About Me,",
        "Education",
        "Courses",
        "My last three books are poetry from Cayuga Lake Books",
        "Courses taught include"
    ],
    "paragraphs": [
        "Ph.D., New York University, 1992.",
        "Master of Arts, New York University: 1986.",
        "Bachelor of Arts, Wesleyan University: 1983.",
        "My research interests focus primarily on the modern drama, with a particular emphasis on issues of gender and sexuality.  My published work engages the drama of such playwrights as Arthur Miller, Tennessee Williams, Tony Kushner, Suzan-Lori Parks, Jackie Sibblies Drury, Jeremy O. Harris, Paula Vogel, August Wilson, Bertolt Brecht, Samuel Beckett, Brian Friel, and Frank McGuinness, among others.",
        "I am the 2017 recipient of a Faculty Excellence Award, granted by the Center for Faculty Excellence at Ithaca College.",
        "Anxious Masculinity in the Drama of Arthur Miller and Beyond: Salesmen, Sluggers, and Big Daddies. Methuen Drama/Bloomsbury Press (2022).",
        "*All My Sons*: Students' Critical Edition, edited and with introductory materials by Claire Gleitman. Methuen Drama/Bloomsbury Press (forthcoming 2023).",
        "“Happy Days is here again:  Encountering Beckett in Extremis,” Ideas and Futures (September 14th, 2020); https://ideasandfutures.com/.",
        "“’What a man!’: Performing Masculinity in Arthur Miller and Tennessee Williams,” Anthology on Arthur Miller for the 21st Century, ed. David Palmer (Palgrave) 2018.",
        "\"Tony Kushner and Tragedy,” Visions of Tragedy in Modern American Drama: From O’Neill to the Twenty-First Century, ed. David Palmer (Bloomsbury Methuen Drama) 2018.",
        "\"Saint-Mamas, Strudel and the Single Man in Arthur Miller's Death of a Salesman,\" The Arthur Miller Journal (Spring 2015).",
        "\"'...then she came, and she cried. And I went back home with her': Arthur Miller's All My Sons and the Prison-House of Gender,\" The Arthur Miller Journal (Fall 2013).",
        "\"Three Characters in Search of a Play: Faith Healer and the Quest for Final Form,\" New Hibernia Review (Spring/Earrach, 2009).",
        "“Another look at those ‘three bollocks in a cell’: Someone Who’ll Watch Over Me and the Shackles of History,” Irish Theatre in America, ed. John Harrington (Syracuse: Syracuse University Press), 2009.",
        "“`I’ll see you yesterday’:  Brian Friel, Tom Murphy, and the Captivating Past,” A Concise Companion to Contemporary British and Irish Drama, ed. Mary Luckhurst and Nadine Holdsworth (London: Blackwell), 2007.",
        "Dangerous Women in Dramatic Literature (cross-listed with WGST)",
        "Dramatic Literature II: Dramatic Literature from Ibsen to the Present",
        "Modern and Contemporary American Drama",
        "Taking it like a Man: Anxious Masculinity and the American Drama (seminar)",
        "Modern and Contemporary Irish Drama (seminar)",
        "Theatre of the Absurd: Beckett, Stoppard, and Churchill (seminar)",
        "Activities: I am the faculty sponsor, along with Kathleen Mulligan (Professor, Theatre Arts) of the On the Verge play-reading series. For information about this organization and its activities, feel free to email me.",
        "ICSM 10500 Global Pop Art",
        "ARTH 13500 Introduction to Visual Culture",
        "ARTH 28500 Art since 1945",
        "ARTH 28600 Art and Globalization",
        "ARTH 29200 Introduction to Museum Studies",
        "ARTH 37500 Contemporary Art from Africa and its Diaspora",
        "ARTH 39500 Anti-Institutional Art and Art Institutions",
        "Ph.D., Columbia University (2015)",
        "M.A., Courtauld Institute of Art, University of London (2004)",
        "B.A., University of Chicago (2002)",
        "Art Across Cultures: Pilgrimage from West to East",
        "Introduction to the History of Museums",
        "Exhibiting African Art",
        "Exhibition Seminar: African Nomadic Architecture",
        "Art and Architecture of Africa",
        "Primitivism in Paris",
        "ARTH 30100: Architectural Studio I (Fundamentals of Architectural Design and Drawing)",
        "ARTH 11300: The Elements of Architecture",
        "ARTH 24000: Architecture Since 1800",
        "ARTH 27590: Modern Architecture of Muslim Cities",
        "ARTH 38000: Architectural History and Theory: The Modern Mosque",
        "ARTH 2000 Islamic Art 650-1250 (Temple University)",
        "Fall 2024",
        "BIOL-22700 Genetics lecture and labs",
        "ICSM-10500-03 & 04 History and Philosophy of Science",
        "Spring 2025",
        "BIOL-11900 Fundamentals of Biology: Cell and Bodies Lectures and Lab",
        "Previously Taught",
        "BIOL-10700 Human Genetics (summer)",
        "HNRS-20048 Honors Seminar - Paradigm Shift: The History and Philosophy of Science",
        "~~~~~~~~",
        "Description of Courses: The catalog is available here.",
        "Student-Faculty Research Options",
        "Student-Faculty Research Options",
        "Learn more about research in the Lo Lab, please visit the lab website.\nLearn more about a Woods - Lo lab collaboration, please visit our IC Tardigrade Website",
        "Join the Lo lab , please email me (tlo@ithaca.edu) directly or click here.",
        "Electrophysiology of plants",
        "Understanding how plants use slow and fast electric responses to light, drought, heat, touch, and sound.",
        "Water properties and plant function",
        "Investigating how the properties of water affect the growth and physiology of aquatic plants.",
        "________________________________________",
        "Student-Faculty Research Options",
        "Student-Faculty Research Options",
        "B.A. Grinnell College, Biology",
        "M.S. University of Tennessee, Botany",
        "Ph.D. University of Tennessee, Plant Physiology & Genetics",
        "My research addresses questions about the evolutionary history of plants. To answer such questions, I and my research students analyze plant DNA. Molecular systematics is the use of DNA (and other molecules) to reconstruct phylogenies (our best guesses of evolutionary history). We have used molecular systematics to study the evolutionary relationships among different species of plants in the order Cucurbitales  (cucumbers, squashes, begonias, and a few other smaller plant families). We are also using DNA at the level of populations to study small-scale evolution within a species. Population genetics is the use of genetic information to characterize the variation that exists in populations.",
        "The questions that most intrigue me are evolutionary ones. For example, how did Hillebrandia (a begonia) come to exist in Hawaii and nowhere else? How did bacterial symbioses in plant roots evolve? How do plants and their parasites co-evolve?  More recently, my students and I have begun to look at the question of how species evolve on islands. We are characterizing the genetic variation in the inkberry (Scaevola plumieri) in Puerto Rico using microsatellites as a way to understand how this native species might be impacted by a closely related invasive species (Scaevola taccada).",
        "PhD Stanford University School of Medicine\n\t         (Developmental Biology)",
        "BA Stanford University (Music)",
        "BS Stanford University (Biology)",
        "I study the development and function of the nervous system.  My research focuses primarily on genetics and genomics of coordinated movement, and movement disorders.",
        "Student-Faculty Research Options",
        "Biochemistry Program faculty member",
        "Honors Program faculty member",
        "Neuroscience Minor, Advisor",
        "Ithaca College offers a Neuroscience minor for those students interested in an interdisciplinary study of the nervous system.  The minor includes courses from several departments, including Biology, Psychology, and Exercise Science.  The minor includes both classwork and a research/practicum experience.",
        "Pre-Health Sciences, Chair, Health Professions Advisory Committee",
        "low melting ionic salts based on carborane and ortho-carborane anions\ntransition metal electrophilic complexes with weakly-coordinating carborane anions\nrhodium pincer complexes for alkyne polymerization catalysis (in collaboration with Professor Oleg Ozerov group in Texas A & M)",
        "Please proceed to our research web-site to find out more about these projects.",
        "Undergraduate students' names are in bold.",
        "\"Reactivity of electrophilic Cp*Ru(NO) complex towards alcohols\" Diaz, J., Rich, K., Munie, S., Zoch, C.R., Hubbard, J.L., Larsen, A.S. Polyhedron, 114, 435-442 (2016)",
        "\"1-Butyl-2,3-dimethylimidazolium dicarba-7,8-nido-undecaborates\" Klemes, M.J., Soderstrom, L., Hunting, J.L. and Larsen, A. Acta Crystallographica, E71, o183 (2015)",
        "\"Nitroxyl (azanone) trapping by metalloporphyrins\" Doctorovich, F., Bikiel,D., Pellegrino, J., Suárez, S.A., Larsen, A., Martí, M.A. Coordination Chemistry Reviews 255, 23–24, 2764–2784 (2011)",
        "\"A Weakly Coordinating Anion as a Tripodal ‘Br3’-Ligand for Platinum(IV): Structure of [(closo-CB11H6Br6)PtMe3]\"  De Crisci , A.G.,  Kleingardner, J., Lough, A.J., Larsen, A. and  Fekl, U.  Canadian Journal of Chemistry, 2008",
        "\"N-Butylpyridinium undecachlorocarbadodecaborate and comparison with similar compounds\" Suarez,S. A., Foi, A., Eady, S., Larsen A., Doctorovich , F. Acta Cryst. C67, o417-o420 (2011)",
        "\"Designing ionic liquids with boron cluster anions: alkyl pyridinium and imidazolium [nido C2B9H11] and [closo-CB11H12] carborane salts\" Dymon,J., Wibby,R., Kleingardner,J., Tanski, J.M., Guzei, I.A., Holbrey,J.D., Larsen,A.S.  Dalton Trans., 2008",
        "\"(Glycol-[kappa]^[2]O,O')nitrosyl([eta]^[5]-pentamethylcyclopentadienyl) ruthenium(II) bis(trifluoromethanesulfonate)\" S. Munie, A. Larsen and M. Gembicky Acta Cryst. (2008). E64, m293",
        "\"Di-mu -nitrosyl-bis[( 5-pentamethylcyclopentadienyl)ruthenium(0)](Ru-Ru)\"  Pearsal,M., Gembicky,M., Dominiak,P.,Larsen, A., Coppens, P.,  Acta Cryst. (2007). E63, m2596",
        "\"Hydrogen Atom Transfer from Iron(II)-tris[2,2'-bi(tetrahydropyrimidine)] to TEMPO: A Negative Enthalpy of Activation\" Mader, E.A.; Larsen, A.S.; Mayer, J.M. J. Am.Chem. Soc, 2004; 126 (26); 8066-8067",
        "\"Non-Organometallic Mechanisms for C-H Bond Oxidation\" Mayer, J., Larsen, A., Bryant, J., Wang,K.,Lockwood, M., Rice, G., Won, T.-J. in ACS Symposium Series \"Activation and Functionalization of C-H Bonds” 2004, edited by Karen Goldberg and Alan Goldman  (chapter 21)",
        "\"Electron and Hydrogen Atom Self-Exchange Reactions of Iron and Cobalt Coordination Complexes\" Yoder,J.C.; Roth, J.P.; Gussenhoven, E.M.; Larsen, A.S.; Mayer, J.M. J. Am.Chem. Soc. (2003) 125, 2629-2640",
        "Multiple  internal smaller grant awards to the students for summer research support  including IC Dana Internships, Regional ACS section internships, two minority scholar summer internships from the American Chemical Society Petroleum Research Fund, NSF REU awards for joint porjects and IC summer faculty research grants.",
        "2010 Fulbright Lecturer/Scholar Award for joint project with University of Buenos Aires, Argentina,  which focused on carborane ionic materials structural studies and nitroxyl chemistry research.  Followed by 2013-2015 Fulbright Alumni Ambassador appointment.",
        "\"Advancing Organometallic Catalysis via Incorporating Weakly-Coordinating Carborane Anions into Cationic Half-Sandwich Electrophilic Complexes\" ACS PRF 35K (2006) for 2+ years",
        "\"Non-coordinating carborane counterions for cationic organometallic catalysis\"  Research Corporation Cottrell College Award 39K (2006) for 2+ years",
        "Co-PI to  National Science Foundation Major Research Instrumentation Grant proposal: Acquisition of an NMR Spectrometer to Support Undergraduate Research and Curriculum Reform 257K (2005)",
        "\"Design of Ionic liquids based on non-coordinating carborane anions\" submitted to Research Corporation - currently under revision.",
        "COMP-190: SQLite: Survey, name a course you are taking, results, shared workspace",
        "COMP-290/375: Database Systems",
        "COMP-365: Computer Networks",
        "COMP-311: Algorithms",
        "COMP-224: Geographic Information Systems",
        "COMP-115: Discrete Structure",
        "COMP-220: Data Structures",
        "COMP-171: Foundations of CS",
        "COMP-210: Organization",
        "COMP-110: Quantitative Reasoning & Data Analysis",
        "COMP-105: Web Programming",
        "Stochastic Systems (different institution)",
        "CCSCNE 2023: Spreadsheets as Hands-On Learning Tools in Discrete Structures",
        "ITICSE 2019: Connecting Majors' and Non-Majors' Courses with Tabular Data",
        "ITICSE 2018: Exploring the MST Quality Nuances Of Prim's And Kruskal's Algorithms",
        "SIGCSE 2018: Holistic Approaches in Computer Science Education",
        "SIGCSE 2018: GIS Opportunities in CS Education",
        "June 2012 – December 2013: National Endowment for the Humanities, HD-51431, $50,000. Untangling the Web of Historical Thinking: What the Structures of Student-Produced Wikis Reveal [Michael Smith, Ali Erkan]",
        "September 2011 – May 2012: Fulbright Fellowship. Fulbright U.S. Scholar Program, U.S. Department of State. Using Geographic Information Systems For Cross-Cultural Scholarship [Ali Erkan]",
        "June 2010 - June 2012: Educating the Educator, Ithaca College. $29,250. Integrative Learning Through GIS [Ali Erkan, John Barr]",
        "June 2009 – June 2012: , National Science Foundation DUE-0837721, $149,104. Multidisciplinary Sustainability Modules: Integrating STEM Courses [Tom Pfaff, Ali Erkan, Jason Hamilton, Michael Rogers]",
        "2018: ITiCSE Conference Best Paper Award for \"Exploring the MST Quality Nuances Of Prim's And Kruskal's Algorithms\"",
        "2014: Ithaca College Faculty Excellence",
        "Algorithms and Data Structures",
        "Computer Organization",
        "Data Structures",
        "Computer Networks",
        "This is a society dedicated to saving at least a few of the earthworms we see stranded on the sidewalks, roads, etc, after it rains. Earthworms are very useful animals. Membership is automatically granted for anyone who saves an earthworm; please communicate your good deed to Ali with an email (our reporting is based on an honor-code). All memberships expire at the end of the current semester to encourage members saving multiple worms.",
        "Members: Metin Erkan (AKA Babam AKA Dede), Griffin Nichols, Michael Smith, Isaiah Smith (the one on the left), Sima Etaner-Uyar, Rebecca Shapley.",
        "“Live as if you were to die tomorrow. Learn as if you were to live forever.”-- Mahatma Gandhi",
        "\"Democracy cannot succeed unless those who express their choice are prepared to choose wisely. The real safeguard of democracy, therefore, is education.\" -- Franklin D. Roosevelt",
        "\"In a way, it seems like the cruelest joke in existence has been played on us. We became self-aware only to realize this story is not about us.\" -- Kurzgesagt",
        "M 12:00 - 1:00 in office",
        "W 12:30 - 1:30 in office, 4:30 - 5:30 on zoom",
        "F  12:00 - 1:00 in office",
        "Current students have a link for zoom office hours on their canvas site. Anyone else please email me to get a link for zoom office hours.",
        "COMP 17200 - Principles of Computer Science II",
        "COMP 22000 - Introduction to Data Structures",
        "COMP 35400 - Intelligent Systems (2021 SP, 2019 FA)",
        "COMP 34500 - Introduction to Software Engineering (2016 SP - 2021 SP)",
        "COMP 32100 - Programming Languages (2020 FA, 2015 FA, 2015 SP, 2014 SP)",
        "COMP 22000 - Introduction to Data Structures (2013 FA - 2024 FA)",
        "COMP 17200 - Principles of Computer Science II (2022 - 2024)",
        "COMP 17100 - Principles of Computer Science I (2013-2019)",
        "My most recent CV can be found here",
        "Learning to Learn: the Science of College Success",
        "Exploring the Options: Finding Purpose and a Path in College",
        "Why are we Here? Student Culture and the Problem of College",
        "The Little Dickens",
        "Dickens and London",
        "Romantic and Victorian Literature and Cultures",
        "Fallen Women and Ruined Men: Studies in Nineteenth-century English Literature",
        "Progress and Peril: Studies in the Nineteenth-century British Novel",
        "Practice and Pedagogy for the Secondary School English Teacher",
        "Professional Semester in Secondary Education",
        "\"Teaching Critical University Studies: a First-Year Seminar to Cultivate Intentional Learners.\" Honors in Practice. v16 p93-126 (2020).",
        "“(De)regulation Acts: The Democratization and Erasure of Travel in Thackeray’s Barry Lyndon” in Transport in British Fiction, 1840-1940. Adrienne Gavin and Andrew Humphries, editors. Palgrave MacMillan. (2015).",
        "\"Lessons from the Gutter: Sex and Contamination in Trollope's The Way We Live Now.\" Victorian Literature and Culture.39.2 (September, 2011). Cambridge U Press.",
        "“The impact of a short-term urban field placement on teacher candidates' perceptions of urban schools, students and teachers.” Teaching and Teacher Education.27 (November 2011) 1170-1178. Elsevier.",
        "\"Legible Liars: Thackeray's Barry Lyndon as Professor of Imposture.\"  Pivot: A Journal of Interdisciplinary Studies and Thought. Volume 1 (May, 2011). York University, Canada.",
        "\"The Last Class: Critical Thinking, Reflection, Course Effectiveness, and Student Engagement.\" Honors in Practice. Volume 6 (April, 2011). National Collegiate Honors Council. U Nebraska Press.",
        "\"First-Year Virtual Summer Seminars: Building Buy-In Before Day 1.\" National Conference on the First-Year Experience. February 18, 2021.",
        "“Why Are We Here? A Seminar in Finding Academic Purpose.” National Conference on the First-Year Experience. February 2019, Las Vegas, NV.",
        "“If They Build It, They Will Come: Partnering with Students as Curricular Designers and Teachers.” National Conference of the Popular Culture/American Culture Association. April 2019, Washington, D.C.",
        "“Politics and Protest in Contemporary Music: Pedagogies for Cultivating Engaged, Intentional Learners.” Northeast Popular Culture Association. Wooster, MA. October 19, 2018",
        "“Town and Gown: Building Connections Through Community Reading Programs.” National Convention of the Association of Writers and Writing Programs (AWP). Washington, DC, February 10, 2017.",
        "\"Reclaiming Redneck:  Socio-cultural Appropriation of the “R” Word in Working Class American Culture.\" National Convention of the American Culture Association (PCA/ACA). New Orleans, LA, April 1, 2015",
        "“As Seen On TV: Using Music Video to Teach Media Literacy and Critical Thinking about Race, Class and Gender.” Annual Convention of the National Council of English Teachers (NCTE). Washington, DC, November 20, 2014.",
        "\"Hip Hop, Thrift Shop and the Activist Impulse: Teaching the Political and Cultural Work of Macklemore and Ryan Lewis.\" National Convention of the American Culture Association (PCA/ACA). Chicago, IL, April 15, 2014",
        "“Digging, Discussing and Debating: Strategies for Active Student Engagement in English Classrooms.” Presenting with Linda Hanrahan, Ithaca College; Teresa Michel, Ithaca College; and Jeane Copenhaver-Johnson, Ithaca College. Annual Convention of the Conference on College English (CEA). Baltimore, MD, March 28, 2014",
        "“Competing Literacies in the ELA Classroom: Cultivating Media Literacy and Critical Thinking as Transferable Skills.” Annual Convention of the National Council of English Teachers (NCTE). Boston, MA, November 17, 2013.",
        "“Student-faculty Team Teaching and Student-led Seminars.” National Collegiate Honors Council (NCHC) Annual Convention.  Fellow presenters Natalie Lazo, Kaitlin Hulburt, and Victoria Wolak, Ithaca College. Boston, MA. November 17, 2012.",
        "\"'Teaching Creatively in an Era of Standardization.\" Annual Convention of the National Council of English Teachers (NCTE). Las Vegas, NV, November 16, 2012.",
        "Dickens In Ithaca: A Celebration of Charles Dickens’s 200th Birthday",
        "http://www.ithaca.edu/hs/depts/english/dickensfestival/",
        "Pippi to Ripley: Gender and Popular Culture",
        "http://faculty.ithaca.edu/kkittredge/cfp_pippi_to_ripley/",
        "My research has primarily focused on the resources linguistically and culturally diverse children bring to literate events, although I also conduct research on teacher-inquiry and pedagogies of equity. Over time, I have developed a particular interest in how young children understand issues of race, class, and faith. Classroom read-alouds have been valuable spaces in which teachers and I have been able to learn more about how children’s understandings of these topics are developing, how their inquiries into these topics are mediated, and how children use these understandings to support their emerging literary understandings. I have also participated in multiple teacher-inquiry communities, exploring methods to combat homophobia and heterosexism in classrooms and finding ways to better understand and increase the engagement of quiet or reluctant students. Students, classroom teachers, and I have jointly presented research at national and international conferences or co-authored research papers and book chapters as a result of our collaborative work. I welcome inquiries from IC students or local classroom teachers interested in exploring applications of social, critical, and experiential theories of reader response and/or qualitative practitioner-research together.",
        "Social Foundations of Education and Social Justice Education",
        "Applied Linguistics and Language Acquisition",
        "Content Area Literacies",
        "Reading/Literacy Foundations",
        "Language Arts Methods",
        "Practitioner Research and Qualitative Inquiry",
        "Copenhaver-Johnson, J.F., DiFrancesco, M., Gonzalez, B., Pena-Shaff, J., P. R., & Soyinka-Airewele, P. (2020). Organically grown: A professional development community for department chairs. The Department Chair, 30(4), 9-11. https://doi.org/10.1002/dch.30312",
        "Copenhaver-Johnson, J. F. (2018). Review: [Embarrassment] and the emotional underlife of learning. Journal of Language and Literacy Education, 14(2).",
        "Copenhaver-Johnson, J. F. (2010). Learning about heterosexism as a teacher educator: The resistant student as catalyst for change.  In M. Blackburn, C. Clark, L. Kenney, & J. Smith (Eds.), Acting out: Combating homophobia through teacher activism (pp. 17-36). New York: Teachers College Press.",
        "Copenhaver-Johnson, J., Bowman, J., & Rietschlin, A. J. (2009). Culturally responsive read-alouds in first-grade: Drawing upon children’s languages and cultures to facilitate literary and social understandings. In J. Scott, D. Straker, & L. Katz (Eds.), Affirming students’ right to their own language: Bridging language policies and pedagogical practices (pp. 206-218). New York: Routledge. (Published jointly with National Council of Teachers of English, Urbana, IL.)",
        "Copenhaver-Johnson, J. F. (2007). Rolling back advances in multicultural education: No Child Left Behind and “Highly Qualified Teachers.” Multicultural Perspectives, 9(4), 40-47. https://doi.org/10.1080/15210960701569690",
        "Copenhaver-Johnson, J. F., & Copenhaver, A. R. (2007). Issues of representation in young adult literature with diabetic protagonists. The Dragon Lode, 25(2), 39-45.",
        "Copenhaver-Johnson, J. F., with Geiger, S. (2007). The presence of homophobia in fieldwork: Preparing pre-service teachers to challenge heterosexism and homophobia. Penn GSE Perspectives on Urban Education, 5(1).",
        "Copenhaver-Johnson, J. F., Bowman, J. T., & Johnson, A. C. (2007). Santa stories: Children’s inquiry about race during picturebook read-alouds. Language Arts, 84, 234-244.",
        "Copenhaver-Johnson, J. F. (2006). Talking to children about race: The importance of inviting difficult conversations. Childhood Education, 83, 12-22. Published online July 2012 https://doi.org/10.1080/00094056.2006.10522869",
        "Orcid ID #",
        "Holmes, Chris (2023) \"Disgrace,\" The Bloomsbury Guide to J.M. Coetzee. Edit. Andrew Van Der Vlies and Lucy Graham. London: Bloomsbury Academic.",
        "DOI: 10.5040/9781350152076.ch-13",
        "Holmes, Chris (2023) \"B-Sides: Haruki Murakami's After the Quake,\" Public Books.",
        "Holmes, Chris & Thom Dancer (2021) \"The Novel at the Limit,\" Critique: Studies in Contemporary Fiction, 62:4, 374-385, DOI: 10.1080/00111619.2021.1904816",
        "Homes, Chris & Thom Dancer (2021) Editors. Special Issue: The Novel at the Limit, Critique: Studies in Contemporary Fiction, 62:4",
        "Holmes, Chris. (2021) \"The Booker Prize and Post-Imperial British Literature.\" Oxford UP ORE Literature.",
        "Holmes, Chris and Kelly Mee Rich. (2021) \"On Rereading Kazuo Ishiguro.\" MFS Modern Fiction Studies, vol. 67 no. 1, 2021, p. 1-19. Project MUSE muse.jhu.edu/article/786756.",
        "Holmes, Chris and Kelly Mee Rich. (2021) \"Ishiguro After the Nobel.\" Editors. MFS Modern Fiction Studies, vol. 67 no. 1, 2021.",
        "Holmes, Chris. (2019) \"Out of Place: Ishiguro's World Literature.\" A Companion to World Literature. Edit. Venkat Mani. Wiley Blackwell (10/2019)",
        "Holmes, Chris (2019) “Ishiguro at the Limit: The Corporation and the Novel.” Novel: Forum on Fiction. (1 November 2019)",
        "Holmes, Chris (2019) \"Exercises in Style: Zadie Smith and the Novel After Form.\"The Companion to Contemporary British and Irish Literature. Edit. Richard Bradford, Stephen Butler, Madelena Gonzalez, James Ward. London: Wiley-Blackwell Press.",
        "Fall 2023: \"Television and the Global Novel\"",
        "Spring 2022: \"The Novels of Kazuo Ishiguro\"",
        "Fall 2021: \"The End of Privacy: Surveillance and Modern Literary Culture\"",
        "Fall 2021: Ithaca Seminar, \"The Cruelty and Salvation of School: Campus Novels\"",
        "Spring 2018: Senior Seminar: \"Theory Now!!\"; Eyes on the Prize: Race, Gender, and the Politics of the Booker Prize",
        "Fall 2017: First Year Seminar: \"Gun\"; Faking It: Reality Hunger and in Age of Artifice",
        "Spring 2017: In the Age of the Global Novel; Senior Seminar: Global Modernism",
        "Fall 2015: Introduction to Contemporary World Literatures; Writing the Contemporary: Kazuo Ishiguro and JM Coetzee",
        "Fall 2013: Prizing the Postcolonial: Novels of the Booker Prize; Studies in World Literature:  The Post-Apartheid South African Novel*",
        "Spring 2013: Approaches to Literary Studies (The Agony and Ecstasy of Theory)*; Honors Program Seminar: The Novel and the Terrorist Aesthetic*",
        "Fall 2012:  Approaches to Literary Studies (The Agony and Ecstasy of Theory)*; In the Age of the Global Novel*",
        "Spring 2011:  Faking It: The Hoax and the Novel; Studies in World Literature:  The Post-Apartheid South African Novel*",
        "Monday, 10:00am-10:50am; Tuesday, 2:30pm-4:00pm (and by appointment)",
        "Joining the English Department at Ithaca College has proven to be one of the most rewarding experiences in my academic career. Since my arrival in 2012, I have taught courses ranging from a 100-level survey of American literature, to a course focused on narratives of racial passing in American literature, to a course on Black Women writers in the post-Civil Rights era. With the support of my colleagues, I taught an African American literature survey (Spring '14)  in conjunction with my good friend, Dr. Tom Nurmi, who taught the same course that semester at Elmira College. Our students shared readings, gave group presentations, and were partnered up into writing workshop groups to critique one another's written work. We hosted \"movie night\" at IC midway through the semester that gave our students an opportunity to meet face-to-face and chat casually over pizza. The most entertaining course thus far has been my Ithaca Seminar which focuses on the persistence of racial, gendered, sexual, and socioeconomic discrimination through stereotypes in a country deeply invested in postracial rhetoric. We utilize short stories, op-ed pieces, TV interviews, websites, advertisements, personal essays, and paintings to debunk the notion that these forms of discrimination have ceased to exist or no longer matter. The in-class discussions are entertaining, yet powerful, and the students enrolled in this class regularly demonstrate what I have always known to be true - that they are a generation of creative, innovative, mature, and insightful young scholars ready to tackle the difficult challenges of this century.",
        "The faculty in my department also strongly support me in accomplishing my research goals. As someone with a wide array of research interests - the redefinition of African American literature in the context of post-racial discourse, hip-hop's impact on global societies and social movements, and reappropriating the concept of the \"student-athlete\" in higher education, for instance - and who needs to continue developing as a writer, I am always spying forums to have my work critiqued. Thankfully, the junior faculty cohort has invited me to join their writing group, becoming a human sounding board for me to work out some of the complexities of my research. As a result, they helped me wrap up a project on Robert Downey Jr's use of blackface in the film Tropic Thunder, published in Robert Downey Jr. from Brat to Icon (2014), and were instrumental in pushing me to complete a book chapter on ZZ Packer's short story \"Drinking Coffee Elsewhere\" that has been included in the collection Neo-Passing: Performing Identity After Jim Crow (2018). I have received some of the best possible constructive feedback on my work while enjoying baked goods, frothy beverages, and even lighthearted conversation. Very quickly, my colleagues have also become some of my truest, closest friends.",
        "I consider myself incredibly fortunate for this opportunity to work with such knowledgeable, hardworking scholars and students!",
        "EDUCATION",
        "Ph.D. University of Arizona (2012)",
        "M.A. University of Arizona (2008)",
        "B.A. California State University Bakersfield (2006)",
        "INTERESTING COURSES TAUGHT",
        "ICSM 105: [THIS TITLE HAS BEEN CENSORED]: The Language of Hatred in a Postracial World",
        "ENGL 220: Black Women Writers: Writing as Resistance in the Post-Civil Rights Era",
        "ENGL 371: Select Topics in African American Literature: Global Blackness",
        "ENGL 46902: Toni Morrison Across the Decades",
        "IISP 205: Intergroup Dialogue (race/ethnicity)",
        "HIGHLIGHTS",
        "President Shirley M. Collado Award winner (2023)",
        "IC Faculty Excellence Award winner (2016)",
        "Sigma Tau Delta Faculty Co-Sponsor (2013-present)",
        "https://zoeticsubmissions.wixsite.com/zoeticlitmag/home-1",
        "PUBLICATIONS / PUBLIC WRITING",
        "\"The Path of Least Resistance: Sexual Orientation and Race in ZZ Packer's 'Drinking Coffee Elsewhere'\" in Neo-Passing: Performing Identity after Jim Crow: https://www.press.uillinois.edu/books/?id=p083235",
        "\"Layers of Lazarus: Robert Downey Jr. Hits 'True Emotional Paydirt' Through Blackface in Tropic Thunder\" in Robert Downey Jr. from Brat to Icon: https://mcfarlandbooks.com/product/robert-downey-jr-from-brat-to-icon/",
        "Banned Books Op-Ed: https://theithacan.org/46626/opinion/commentary/commentary-banning-book…",
        "What We Mean by 'We Want Dialogue\" Op-Ed: https://theithacan.org/8905/opinion/commentary/commentary-professor-dis…",
        "Get it Together interview: https://www.youtube.com/watch?v=sqEJ90LEEXw",
        "Estranging the Novel: Poland, Ireland, and World Literature Studies (Johns Hopkins University Press, 2021)",
        "\"Two Paths for the Big Book: Olga Tokarczuk's Shifting Voice\", Genre 54.1 (Spring 2021)",
        "\"Constructing a Case: Reflections on Comparative Studies, World Literature, and Theories of the Novel's Emergence,\" Comparative Literature, 69:3 (September 2017)",
        "\"From Fantastic to Familiar: Jan Potocki's Manuscript Found in Saragossa,\" Nineteenth-Century Contexts 37:4 (2015)",
        "\"Sincerely Ironic: Romance at the Edges of Europe,\" in Where Motley is Worn: Transnational Irish Literature, edited by Moira Casey and Amanda Tucker. Cork University Press: 2014.",
        "Review of Divine Days, by Leon Forrest, Los Angeles Review of Books, August 2023",
        "Review of A Ghost in the Throat, by Doireann Ni Ghriofa, KGBBAR Lit Mag, October 2021",
        "“Cold War World Literature: Orhan Pamuk’s White Castle,” Symposium on Orhan Pamuk and the Good of World Literature, by Gloria Fisk, in Syndicate, March 2021",
        "“Close Reading at a Distance: Téa Obreht’s Inland”, with Jennifer Carroll and Ruchama Johnston-Bloom, ASAP Journal website, October 24, 2020",
        "Review of A Little Annihilation, by Anna Janko. Asymptote Blog, June 15, 2020",
        "“My Year in Reading,” Asymptote Blog, December 19, 2019",
        "Introduction to Graphic Novels",
        "Gothic and Detective Fiction",
        "The Matter of Black Lives in the Long 18th Century",
        "Introduction to Women’s and Gender Studies",
        "Jane Austen and Her Contemporaries",
        "Approaches to Literary Study",
        "Fall 2023:  ENGL 113 Introduction to Poetry; ENGL 311 Dramatic Literature I:  The Comic and the Tragic",
        "Spring 2023:  On leave",
        "Fall 2022:  ENGL 113 Introduction to Poetry; ENGL 311 Dramatic Literature I:  The Comic and the Tragic; ENGL 400 Capstone in English",
        "“John Skelton, The Bowge of Court (1499?).”  Handbook of English Renaissance Literature, ed. Ingo Berensmeyer.  Berlin:  DeGruyter, 2019, 225-43.",
        "\"Redeeming the Sonnet Sequence:  Desire and Repentance in Fulke Greville's Caelica,\" Sidney Journal 35 (2017):  141-163.",
        "“Shakespeare and History Writing,” Literature Compass 14 (2017) e12376, 1-10, doi: 10.111/lic3.12376.",
        "Literature Compass:  http://onlinelibrary.wiley.com/journal/10.1111/(ISSN)1741-4113",
        "Girlstories (Ithaca Seminar)",
        "Experiencing College Athletics (Ithaca Seminar)",
        "Wonder Women: Feminist History and Feminist Icons (Honors Ithaca Seminar)",
        "Introduction to Children's Literature",
        "Girlhoods in Literature",
        "Survey of Science Fiction",
        "DIY SciFi",
        "Advanced Studies in Feminist Science Fiction",
        "Feminist Fictions",
        "Imagining Herself",
        "Recent Publications",
        "“Old School Bullying: The Early Roots of Bullying in Harry Potter” co-authored with Carolyn Rennie. The Representation of Cruel Children in Popular Texts Eds. Monica Flegel and Christopher Parkes. Palgrave, 2018.",
        "\"The Blind Made Happy\" Arcs of Reward and Redemption in Early Modern Children's Literature\" Variabilities II. Ed. Chris Mounsey. Peter Lang, 2016.",
        "\"'For the Benefit of Young Women going into Service': Late Eighteenth-Century Proto-YA Novels\" Women's Writing 23:1 (2016): 106-126.",
        "\"Lethal Girls Drawn for Boys:Girl Assassins in Comics/Manga and Film/Anime\" Kittredge, Katharine. Children's Literature Association Quarterly39.4 (2014 Winter): 506-532.",
        "Katharine Kittredge and Elizabeth Bleicher. \"Imagine Local: A New Kind of Science Fiction Convention\" Science Fiction Studies 40.3 (November 2013).",
        "“Chasing the Ghost of Melesina Trench” is a short documentary film about my research on Trench made by IC student , Qina Lui (class of 2013).  This film and an accompanying article can be viewed at http://scholarcommons.usf.edu/cgi/viewcontent.cgi?article=1018&context=…",
        "“Proto-Butch or Temporally-Challenged Trans?: Considering Female Masculinities in Eighteenth Century Britain” in In Search of the Normal: Developments in the Histories of Sexualities 1400-1900 . Ed. Chris Mounsey. Bucknell University Press, 2012.",
        "\"The Day the Descendants Came to Tea\" The Female Spectator, Vol. 16, No. 1 (Winter 2012)",
        "“Missing Immortality: The Case of Melesina Trench (A Neglected, Celebrated, Dismissed and Rediscovered Woman Poet of the Long Eighteenth Century)” Aphra Behn Online: Interactive Journal for Women in the Arts 1640-1830 1.1 (Spring 2011) http://www.aphrabehn.org/aphraonline/volume1/scholarship/kittredge.html",
        "\"Early Blossoms of Genius: Child Poets at the End of the Long 18th Century,\" in Looking Glass: New Perspectives in Children's Literature, 15.2 (2011)",
        "Abstract: Few children from the past have written accounts of their lives which subsequent [adult] generations have found worthy of preservation. A rare exception to this rule can be found in the many books of poetry published by juvenile (under the age of twenty-one) British authors during the late eighteenth and early nineteenth centuries. This study explores the range of these authors' works, along with their reception, and considers how these reflect the attitudes to children at that time.",
        "http://www.lib.latrobe.edu.au/ojs/index.php/tlg/article/view/274",
        "*Spring 2017* Pippi to Ripley 4: Women and Gender in Fantasy, Science Fiction and Comics",
        "The fourth \"Pippi to Ripley\" conference will be held on April 21-22, 2017  at Ithaca College. .  See sidebar for more information.",
        "Archive Project",
        "(sample mini-documentary) http://www.screencast.com/t/hkyIECsdofFQ",
        "https://sites.google.com/site/girlstoriesarchiveproject/",
        "https://sites.google.com/site/onlinegirlmagazines/",
        "seventeenth-century poetry",
        "editing early English drama",
        "horror in literature, film, and philosophy",
        "Selected Courses",
        "ENGL-312, Modern Comedy: Text, Stage, Film",
        "ENGL-311:  Early Modern English Drama by Women",
        "ENGL-210, Modern Horror Fiction",
        "ENGL-219, Why Shakespeare Now?",
        "ENGL-420, Hamlet and its Mysteries",
        "ENGL-373, Tragedy after Marlowe",
        "ENGL-331, English Renaissance Beasts",
        "Recent Publications",
        "\"Holland House in the 1650s: Evidence and Possibilities of Performance,\" Huntington Library Quarterly 85.1 (2022), 41-70.",
        "\"The Drury Lane Cockpit at War, 1646-49,\" Shakespeare Bulletin 37.1 (2019), 67-87.",
        "\"Was Shakespeare 'not a company keeper'? William Beeston and MS Aubrey 8, fol. 45v,\" Shakespeare Quarterly 68.4 (2017),  351-373.",
        "A Critical Edition of Robert Greene’s The Honorable History of Friar Bacon and Friar Bungay (Q1594). Queen’s Men Editions.  General Ed. Helen Ostovich, with Peter Cockett and Andrew Griffin, 2017.",
        "“Marlowe and Theater History,” Christopher Marlowe at 450, eds. Sara Munson Deats and Robert A. Logan. Farnham, Surrey: Ashgate, 2015, 281-308.",
        "“Lost Stage Friars and their Narratives,” in Lost Plays in Shakespeare’s England, eds. David McInnis and Matthew Steggle. London: Palgrave Macmillan, 2014, 208-228.",
        "\"Elizabeth Beeston, Sir Lewis Kirke, and the Cockpit's Management during the English Civil Wars.\"  Medieval and Renaissance Drama in England 27 (2014),161-191.",
        "Secret Sharers: The Intimate Rivalries of Modernism and Psychoanalysis. Fordham University Press, 2023.",
        "\"Rebecca West, Modern Spiritualism, and the Problem of Other Minds\", The Edinburgh Companion to Modernism, Spiritualism, and Religion. Eds. Suzanne Hobson and Andrew Radford (January 2023).",
        "\"Introduction: The Devil is in the Details\" (co-authored with Wong) and \"Scaling the Detail: Woolfian Proportions,\" for \"The Detail, Revisited,\" Modern Language Quarterly 84.1 (April 2023).",
        "\"The Heterodox Psychology and Queer Poetics of Auden in the 30s,\" Journal of Modern Literature, 42.3 (Spring 2019).",
        "\"'I Find My Mind Meeting Yours': Rebecca West's Telepathic Modernism,\" Studies in the Novel 50. 4 (Winter 2018).",
        "“On Not Reading Freud: Amateurism, Expertise, and the ‘Pristine Unconscious’ in D.H. Lawrence,” Modernism/modernity, 21.1 (January 2014).",
        "“Unveiling the Dance of the Seven Veils: Oscar Wilde and the Power of Myth-Making,” Special Issue on Oscar Wilde’s Salome, The Oscholars, (Fall 2012).",
        "\"No Way to Say Goodbye,\" The New York Times (April 26, 2022).",
        "\"Me and Mrs Dalloway: On Losing My Mother to Covid-19,\" Los Angeles Review of Books, Avidly (July 2020).",
        "\"A Mysterious Illness Turned Me Into A Vampire,\" Huffpost (May 2024).",
        "\"Purebloods: The Antisemitism and White Supremacy of the Anti-Vax Movement.\" The Edge (August 2022).",
        "Making It New: British and U.S. Modernism",
        "Queer Lit",
        "Banned Books",
        "Approaches to Literary Study",
        "20th and 21st-Century British Novel",
        "Engendering Modernity: Twentieth-Century Women Writers",
        "Education",
        "Ph.D. New York University (2012)",
        "M.A. New York University (2008)",
        "B.A. Wesleyan University (2002), with honors, Phi Beta Kappa",
        "voluntary conservation by private landowners",
        "environmental hazards of invasive species",
        "cannabis agriculture and its environmental impacts",
        "experiential teaching and learning in the field",
        "Since 2012 I have served as Faculty Manager of the 560-acre Ithaca College Natural Lands (ICNL).",
        "---",
        "Land Stewardship Program (ENVS 201/301/402) of Ithaca College Natural Lands",
        "Human-Environment Geography (ENVS 220)",
        "Forests of the World (ENVS 331) - Part of the Trees Intensive",
        "Water Resources (ENVS 331) - Part of the Water Intensive",
        "Environmental Sentinels (ENVS 120) - Environmental science via wilderness skills",
        "Ithaca (1st Year) Seminar (ICSM 105) - Taking on Environmental Change",
        "Contemporary Applications of Ancient Agriculture",
        "Environmental Archaeology: Human Environmental Impact in the Past and Present",
        "ICSM: Freshman Seminar: Food: Feast, Famine, Taboo",
        "Research in Aquaponics",
        "Research in Dendrochronology",
        "Principles and Practices of Sustainability",
        "Aquaculture Workshop",
        "ARCHAEOLOGY: My research interests are all focused on the interaction between people and their environments through the lens of food–related activities. Because food systems are a direct reflection of both availability and cultural choice, the analysis of food remains can provide important clues about interrelationship between prehispanic populations and their environments. Since 1990 I have been part of a team of archaeologists excavating at La Quemada in the Malpaso Valley of Zacatecas, Mexico. This is an interesting region to study food systems because the amount of rainfall is, at best, marginal for adequate agricultural production. So this region could provide a great case study in human responses to climate change from a long-term perspective.",
        "DENDROCHRONOLOGY: Research in this region is impeded by two things, precise measures of time to date cultural changes, and climate reconstructions at high enough resolution to assess the variability of environmental conditions over space and time. With the goal of addressing both these obstacles, my most recent research uses dendroarchaeology, a combination of tree-ring analysis and 14C-dating, to construct a high resolution tree-ring sequence that can be used to precisely date wood found at archaeogical sites. Together with students from Ithaca College, and in collaboration with researchers from the Tree-Ring Laboratory at Cornell University , we are collecting and studying prehistoric and historic wooden beams from northern Mesoamerica with the goal of developing a chronological sequence that extends back from present to the 4th century A.D.  Go to this LINK for an overview of our preliminary findings of Phase I of this project. By providing a deep time example of a society that may have been forced to adapt to unpredictable and fragile environmental conditions, this research has broad relevance to the rapid environmental changes we are struggling with today.",
        "AQUAPONICS: While conventional food production methods produce large amounts of food, they also produce agricultural waste, deplete the soils, add chemical runoff to natural water sources, and take up large expanses of land.  In contrast, integrated agricultural systems, like aquaponics, are developed on the philosophy of mimicking nature's systems to create productive agriculture with minimum input and close to zero waste. Aquaponics uses fish waste, which is naturally convertible to a form of nitrogen, to nourish plants. Since the inception of the Ithaca College Aquaponics Research Project, more than 40 students have conducted research to evaluate the ability of aquaponics to efficiently produce healthy food in a commercially and environmentally sustainable setting and, as a bonus, has provided students and faculty with fresh herbs, fish (tilapia), and produce. Here is a link to the Ithaca College Project with details on some of the student projects.",
        "What, you ask, does aquaponics have to do with Mesoamerican prehistory?  Actually, aquaponics has it roots in a technology called chinampa agriculture, which was used in Mesoamerica as the source of much of the food consumed by the Aztecs. The nutrient dense organics deposited by fish and plant debris in the canals was used to fertilize the surrounding the raised fields.  These fields were so productive that they could often harvest three crops on the same plot each year!  The connection between these two technologies is an example of the topics we address in my class \"Contemporary Applications of Ancient Agriculture\".",
        "ICSM 105   Ithaca Seminar: World War II and America",
        "HIST 275   History of U.S. Popular Culture",
        "I co-designed a computer language that I used in a college course I designed. The name of the course was \"Mathematical Art with Computers\"",
        "I conducted  many summer math camps for elementary school children",
        "I designed and taught a course for students who are afraid of Math.  The name of the course was \"Math Fun with Computers\"",
        "I volunteered for many years in nursing home and still do.  Designing and directing various programs for the elders including Sunday services",
        "I mastered a way to show students how to learn Math in a creative way that brings out their creative innate mathematical latent talent that we all have.",
        "Currently I volunteer in a local Nursing Home as a spiritual consultant  and became a friend of many of the residents.  I also published my mother's book and also a book of poems based on her life story in the Holocaust.",
        "Link to my mother's book",
        "Link to the poems",
        "This is my Old Story that include personal, biographical and professional information....",
        "Ph.D, Yale University, Italian Language and Literature",
        "M.A., Yale University, Italian Language and Literature",
        "B.F.A, State University of New York at Buffalo, Illustration",
        "B.A., State University of New York at Buffalo, Italian",
        "I joined the Department of Modern Languages and Literatures of Ithaca College in Fall 2001 after serving on the faculty of Wells College (Aurora, NY), Cornell University (Ithaca, NY) and the State University of New York at Buffalo.",
        "My scholarship and publications lie primarily in two areas: Italian literature and pedagogy.  My doctoral research focused on the relationship between imagination, love and reason in Italian Renaissance literature.  I have written on modern literature as well as medieval and Renaissance literature, and, more recently, I have been exploring the relationships between literature, art, and animal studies. My pedagogical work ranges from language textbooks to articles on teaching literature, touching on translation, the visual arts, and technology..",
        "I teach language, literature, and culture courses at all levels, in both English and Italian. I am happy to answer any questions about the World Languages and Cultures major (Italian focus) and the Italian Studies minor if you would like to know more about these programs.",
        "Elementary and Intermediate Italian courses",
        "Italian Conversation courses",
        "Italy: Language and Culture (summer study-abroad course in Italy)",
        "Inferno to Infinity: Italian Literature in Translation",
        "Experiencing Italy: Remarkable Cities",
        "Nineteenth and Twentienth-Century Italian Literature",
        "Love, Lust and the Black Death: Boccaccio's Decameron",
        "Images of Hell: Dante's Inferno",
        "Animal Images: Literature, Human Nature, and the Animal World (Ithaca Seminar)",
        "Cozzarelli, Julia. Sentieri: Attraverso l’Italia contemporanea. Boston: Vista Higher Learning (now in 4th edition: 2023). (Elementary-level Italian textbook)",
        "Abbiati, Silvia and Julia M. Cozzarelli. Da capo: Student Activities Manual, 7th Edition. Boston: Heinle Cengage Learning, 2011. (Intermediate level)",
        "Cozzarelli, Julia M. and Silvia Abbiati. Workbook and Laboratory Manual to Accompany Da capo, 6th Edition. Boston: Thomson Heinle, 2007. (Intermediate level)",
        "Cozzarelli, Julia. “Teaching Ugolino’s Choice in the Undergraduate Classroom: A Multidisciplinary Approach.”  Studies in Medieval and Renaissance Teaching (SMART), 25.1 (Spring 2018): 157-170.",
        "Cozzarelli, Julia. “Between Reality and Symbol: Fierce Dogs and Ferocious Wolves in the Decameron.”  Quaderni d’Italianistica, 38.1 (2017): 109-129.",
        "Cozzarelli, Julia. \"Canines in the Classroom: Boccaccio, Dante, and the Visual Arts.\" Humanities, 5.3 (2016): article 68.  http://www.mdpi.com/2076-0787/5/3/68/html. In Special Issue The Short Story and the Italian Pictorial Imagination, from Boccaccio to Bandello and Beyond, ed. Patricia Emison.",
        "Cozzarelli, Julia. “Poscia, più che ‘l dolor, poté ‘l digiuno: Translation and Interpretation in Inferno XXXIII.” Romance Notes, 54.2 (2014): 151-160.",
        "Cozzarelli, Julia.“Reading, Writing, Desire and Closure: Teaching Calvino to Undergraduates in Italian.”  Approaches to Teaching the Work of Italo Calvino, ed. Franco Ricci. New York: Modern Language Association of America, 2013. 90-94.",
        "Cozzarelli, Julia.“Torquato Tasso and the Furore of Love, War and Madness.” Italica, 84.2-3 (Summer/Fall 2007): 173-186.",
        "Cozzarelli, Julia.“Genius, Madness, and Knowledge: Ficino, Landino, and Ariosto's Lovers.” Quaderni d’italianistica, 6.2 (Fall 2005): 3-27.",
        "Cozzarelli, Julia.“Love and Destruction in the Decameron: Cimone and Calandrino.” Forum Italicum, 38.2 (2004): 348-363.",
        "Global Screen Cultures",
        "Latin American Revolutions",
        "Latinx Culture through Literature",
        "New Latin American Cinema",
        "Madness and Power in Latin America",
        "Latin American Civilization and Culture",
        "Spanish Translation in Practice",
        "Cross-Cultural Journeys through Cinema",
        "Experiencing Hispanic Literature",
        "Elementary and Intermediate Spanish",
        "The Novel in the Mirror: Latin American Literature on Film",
        "Memory, Exile, and Revolution in Caribbean Literature and Film",
        "Ph.D., Department of Hispanic Languages and Literatures, University of Pittsburgh",
        "Certificate in Latin American Studies, Center for Latin American Studies, University of Pittsburgh",
        "M.A. Department of Hispanic Languages and Literatures, University of Pittsburgh",
        "B. A. Wells College, Aurora, New York,; Major: Latin American",
        "Gladys M. Varona-Lacey teaches Spanish and Latin American Literature in the Department of Modern Languages and Literatures at Ithaca College. She earned her M.A. and Ph.D. in Hispanic Languages and Literatures and a Certificate in Latin American Studies from the University of Pittsburgh. She teaches all levels of Spanish language courses as well as Latin American literature, her specialty. Professor Varona-Lacey has authored and edited several books in her field and has taught at M.I.T., Tufts University, Boston University, and Harvard University. Among her recent publications is “El rescate de una adolescencia cubana a través del recuerdo. Un estudio de Nieve en La Habana de Carlos Eire” in Cuba: Arte y literatura en el exilio (2011).",
        "Professor Varona-Lacey has chaired her department, co-directed the Latin American Studies minor, and served as a member of the College Board’s AP Higher Education Advisory Committee. She is General Editor of Peter Lang Publishing’s Latin America: Interdisciplinary Studies series, co-directs Ithaca College’s Certificate Program in International Business, and served as a member of the IES Curriculum Committee. In May 2011 she was awarded the Faculty Excellence Award. Professor Varona-Lacey served the Town of Danby, New York, as an elected board member from 2000 to 2008.",
        "Courses",
        "Elementary Spanish",
        "Conversation I: Contemporary Issues",
        "Introduction to Latin American Literature",
        "Latin American Poetry and Drama",
        "Modernismo",
        "Topics in Latin American Literature (e.g., Women in Latin American Literature)",
        "Independent Studies",
        "Recent Publications",
        "“El rescate de una adolescencia cubana a través del recuerdo. Un studio de nieve en la Habana de Carlos Eire.” Cuba: Arte y Literatura en exilio. Eds. Grace Piney and James J. Pancrazio. Valencia, Spain: Legua Editorial, 2011.",
        "“The Costa Rican Theater” in Dictionary of Latin American Theater. Westport, CT: Greenwood Press, 2003.",
        "Contemporary Latin American Literature. Boston: McGraw-Hill, 2001.",
        "José María Arguedas: más allá del indigenismo. Miami, FL: Ediciones Universal, 2000.",
        "Latin America: An Interdisciplinary Approach.  Edited with Julio López-Arias. New York: Peter Lang Publishing Company, 1999.",
        "Introducción a la literatura hispanoamericana: de la conquista al siglo XX. Chicago, Illinois: National Textbook Company, 1997.",
        "Manual for Introducción a la literatura hispanoamericana. Chicago, Illinois: National Textbook Company, 1997.",
        "Test Yourself in Spanish Grammar. Co-authored with Julio López-Arias. Chicago, Illinois: National Textbook Company, 1996.",
        "MWF 9am  Elementary French I",
        "MWF 10am Elementary Italian II",
        "T Th 9:25am Ithaca Seminar: Love, Science and Magic in the Middle Ages",
        "T Th 10:50am Ithaca Seminar: Love, Science and Magic in the Middle Ages",
        "",
        "US Foreign Policy - POLT 30600",
        "Terrorism and Insurgencies - POLT 33800",
        "Crossing Borders / Global Migration - POLT 33500",
        "​​​​Sel.Topics: Pirates and Mercenaries: Sovereignty in the Int'l System",
        "Ithaca Seminar: War, Peace, and Terrorism",
        "Russian Politics",
        "Whiteness and Multiculturalism",
        "Seminar on Missionaries for Democracy​",
        "“Dayton and right-wing nationalism in the West,” in Godišnjak za sociologiju (Annual Review of Sociology), Faculty of Philosophy, University of Niš (Serbia), no.23 (2019).",
        "Post-Conflict Studies: An interdisciplinary approach. Co-edited with Keith Brown (Routledge, 2014). Part of Routledge's series Studies in Peace and Conflict Resolution.",
        "\"Democracy Promotion as Mission\" in Post-Conflict Studies: An Interdisciplinary Approach.",
        "Political Science and the Yugoslav Dissolution: The Evolution of a Discipline,” in Florian Bieber, Armina Galijaš and Rory Archer, eds. Debating the End of Yugoslavia (Ashgate, 2014).",
        "“Yugoslavia in 1989 and after,” in Nationalities Papers: The Journal of Nationalism and Ethnicity, vol.38, no. 1 (January 2010), pp.23-39",
        "“Catholic Relief Services, USAID, and Authentic Partnership in Serbia” in Transacting Transition: The micropolitics of democracy assistance in the former Yugoslavia, Keith Brown, ed. (Kumarian Press, 2006), pp.167-188.",
        "The Myth of Ethnic War: Serbia and Croatia in the 1990s (Cornell University Press, 2004), Winner of the American Political Science Association's Prize for the Best Book on European Politics and Society and co-winner of the Best First Book Award of the Council for European Studies.",
        "US Institute of Peace Solicited Grant Program",
        "IREX Short-Term Travel Grants",
        "Ithaca College Summer Faculty Research Grant",
        "SSRC-MacArther Foundation Postdoctoral Fellowship in Peace and Security in a Changing World",
        "Title VIII Research Fellowship in Russian and East European Studies",
        "To access my website, click here.",
        "1) \"The Duty to Resist: Bayard T. Rustin’s Pragmatic Quaker Faith\" in Friends Journal:  https://www.friendsjournal.org/the-duty-to-resist/",
        "2) Book Foreword to Surendra Bhana's The United States and the Development of the Puerto Rican Status Question, 1936 - 1968 (Kansas Press, 2021 [1975]): https://www.jstor.org/stable/j.ctv1p2gkbn.4?refreqid=excelsior%3A6a81d53f5cde66c335dab3b5aae49e62&seq=1#metadata_info_tab_contents",
        "3) \"Working-Class America Needs Real Change, Not Slogans\":  https://www.fairobserver.com/region/north_america/carlos-figueroa-2020-us-presidential-election-donald-trump-joe-biden-working-class-americans-73991/?fbclid=IwAR0jZRiA_MqXeLFrIql_R26rz36nvbeGxYrFjoic1WjV4xW6BMuyeTCePpc",
        "4) \"The Puerto Rico Crisis:  A Reflection of a Flawed US Democracy\":  https://www.fairobserver.com/region/north_america/puerto-rico-us-territory-ricardo-rossello-world-news-34709/",
        "Also published separately in Spanish at Revista Comun:  https://www.revistacomun.com/blog/la-crisis-de-puerto-rico-reflejo-de-una-democracia-estadounidense-defectuosa",
        "5) \"US Supreme Court and its educative role within a deliberative democratic system\":  https://czasopisma.uni.lodz.pl/annales/article/view/4440",
        "6) \"Developing Practical/Analytical Skills through Mindful Classroom Simulations for 'Doing' Leadership\" https://www.tandfonline.com/doi/abs/10.1080/15236803.2014.12001774",
        "\"Quaker Political Interventions, and US Puerto Rico Policy Development, 1900 - 1917,\" The Journal of Race and Policy, Vol. 11, No. 1 (Spring/Summer 2015), pp. 36 - 54.",
        "I am also working on several research studies on black gay Quaker labor and civil rights thinker & activist Bayard Rustin.  In February 2016, I gave an invited talk on Rustin at Illinois State as a University Speaker and as part of their Black History Month celebration.  Please listen to my National Public Radio (Normal, Illinois) conversation on Rustin and his Quakerism here (17 minutes): https://www.wglt.org/show/wglts-sound-ideas/2016-02-23/gay-civil-rights-leader-grounded-in-quaker-upbringing#stream/0.",
        "https://mediainnovation.camd.northeastern.edu/2023/masters23/rajesh/",
        "https://daily.jstor.org/adolph-reed-jr-the-perils-of-race-reductionism/",
        "https://www.delish.com/food-news/a37544138/latinx-history-what-is-a-bodega/",
        "https://www.commondreams.org/news/2020/11/01/no-mr-president-sanders-says-election-day-youre-not-standing-working-families",
        "https://www.newstatesman.com/world/north-america/2018/09/hurricane-maria-may-have-been-us-s-deadliest-natural-disaster-ever-trump",
        "https://depauliaonline.com/40698/nation/trump-foreign-aid-cuts-to-central-america-exacerbating-cycle-of-despair/",
        "https://www.bupipedream.com/news/95036/students-discuss-implications-of-citizenship-question-on-2020-census/",
        "https://www.fairobserver.com/author/carlos-figueroa/",
        "https://www.commondreams.org/author/carlos-figueroa",
        "https://www.revistacomun.com/colaboradores",
        "https://twitter.com/figueroaphd",
        "https://ithaca.academia.edu/CarlosFigueroa",
        "https://www.realclearpolitics.com/epolls/latest_polls/",
        "http://www.buzzsawmag.org/",
        "https://www.wsws.org/en?redirect=true",
        "Funke, Cornelia. Reckless. Boston: Little, Brown and Co. 2010",
        "Karns and Mingst. International Organizations: The Politics and Policies of Global Governance. Lynne Rienner, 2023.",
        "Lowi, Ted, et al. American Government: A Brief Introduction. W. W. Norton, 2018.",
        "Morón, Ciriaco. El alma de España: Cien años de inseguridad. Ediciones Nobel, 2013.",
        "Sidlow, Edward. Freshman Orientation: House Style and Home Style. Washington DC: CQ Press, 2007",
        "United Nations Guide to Model UN. NY: United Nations, 2020",
        "\"Male Egos and their Class In Black and White\": http://www.onlineopinion.com.au/view.asp?article=9288",
        "\"Decoding the Sonia S. Hearings\": http://www.onlineopinion.com.au/view.asp?article=9208",
        "\"What is a Woman Anyway and Who Cares\": www.zed-books.blogspot.com",
        "",
        "",
        "",
        "",
        "",
        "Ph.D., Syracuse University, Experimental Psychology",
        "M.A., Xavier University, Experimental Psychology",
        "B.S., St. Lawrence University, Psychology",
        "The research conducted in my laboratory at Ithaca College focuses on recognition memory for emotional stimuli. The memory for emotional stimuli has long been found to differ from the memory for neutral stimuli. However, emotion's influence is now understood to be more complicated than purely a mechanism for enhancing memory.  Several current researchers now contend that enhanced memory for emotional stimuli is actually mediated via the combination of several additional variables known to influence memory independent of any emotional significance (e.g., increased relatedness, attention and distinctiveness). Most commonly, our research fails to find that emotion enhances recognition memory accuracy and instead finds that the most robust influence is elevated false memory for emotional material. My research team and I conduct experimental research designed to assess if the variables forwarded to moderate and mediate emotion's influence on memory accuracy, and the respective theories, extend to emotion's influence on false memory formation.",
        "I began teaching at Ithaca College in the Fall of 2009. Listed below are the courses I have taught, which represent my diverse interests in neuroscience and experimental, cognitive, and developmental psychology (primary courses listed first).",
        "Matters of the Mind (ICC: Mind, Body, Spirit Theme - Natural Science Perspective)",
        "Cognition",
        "Research Team (Team EPIC: Emotional and Physiological Influence on Cognition)",
        "Proseminar in Development",
        "Psychology of Aging",
        "Behavioral Neuroscience",
        "Research Methods in Psychology",
        "Seminar in Neuroscience (Topic: Cognitive Neuroscience of Aging)",
        "Development of Adolescence",
        "Methods in Neuroscience",
        "Proseminar in Motivation",
        "Bessette-Symons, B. (in press).  The robustness of false memory for emotional pictures. Memory. Advanced online publication. doi:10.1080/09658211.2017.1339091.",
        "Ritchey, M., Bessette-Symons, B., Hayes, S.M., & Cabeza R. (2011). Emotion processing in the aging brain is modulated by elaboration. Neuropsychologia, 49, 640-650.",
        "Hoyer, W.J., & Bessette-Symons, B.  (2010). The neuroscience of aging and cognition.  In Penelope Peterson, Eva Parker, Barry McGraw (Eds.) International Encyclopedia of Education (3rd    ed., Vol 5, pp. 340-344). Oxford: Elsevier.",
        "St. Jacques, P.L., Bessette-Symons, B., & Cabeza, R.  (2009). Functional neuroimaging studies of aging and emotion: Front-amygdalar differences during emotional perception and episodic memory.  Journal of the International Neuropsychological Society, 15, 819-825.",
        "Howard, M.W., Bessette-Symons, B.A., Zhang, Y., & Hoyer, W.J.  (2006). Aging selectively impairs recollection in recognition memory for pictures:  Evidence from modeling and ROC curves.  Psychology and Aging, 21(1), 96-106.",
        "Kates, W.R., Antshel, K., Willhite, R., Bessette, B.A., AbdulSabur, N., & Higgins, A.M. (2005). Gender moderated dorsolateral prefrontal reductions in 22q11.2 deletion syndrome: Implications for risk for schizophrenia. Child Neuropsychology, 11(1), 73-85.",
        "Kates, W.R., Burnete, C.P., Bessette, B.A., Folley, B.S., Strunge, L.A., Jabs, E.W., & Pearlson, G.D. (2004). Frontal-caudate alterations in velocardiofacial syndrome (deletion 22q11.2). Journal of Child Neurology, 19(5), 337-342.",
        "Forms of Therapy: Overview of different approaches of individual psychotherapy and perspectives regarding change and symptoms of psychological problems. Over the course of the semester we cover topics in the field of psychotherapy including human connection, empathy, assessment, and methods of evaluating the outcome of treatment interventions.",
        "Skills for the Helping Professional: This course introduces students to theory and practice of psychotherapy and other professional helping relationships. Students learn about counseling, assessment, ethics, and helping skills. This course emphasizes basic and specialized skills necessary to function effectively in a helping relationship. Emphasis is placed upon understanding the nature of the helping process in a practical and applied way.",
        "Professional Development II: Exploration of career opportunities and options for individuals with an undergraduate degree in psychology, including graduate school (or other professional training) and employment in a related field.",
        "In addition, I teach an Ithaca Seminar on Health Activism.",
        "have also supervised many student internships and undergraduate student research projects in areas of mental health, therapist preparation, and grief and loss.",
        "Professional Background and Focus",
        "I am one of the only members of the Psychology Department who did not study psychology as an undergraduate. I use my own story to talk with students about how a path to a career may not be linear and completely obvious. I studied Francophone literature, gender studies, literary theory, and feminist theory as an undergraduate at a small women's liberal arts college. I did graduate coursework in creative writing, did grant writing for nonprofit organizations, worked in psychiatric hospital, a group home for adolescent boys, a jail, and a university research department before settling on psychology.",
        "As a counseling psychologist, I am trained in both research and clinical work. I was trained as a therapist and a researcher. I love teaching students about approaches to therapy, careers in helping professions, and helping students navigate internships in the community.",
        "I continue to provide clinical services (mostly therapy and training) in the community. I have worked with a local harm reduction health equity medical practice to develop their behavioral health program. I am passionate about ensuring that individuals, especially those from marginalized and oppressed groups, receive trauma responsive social and behavioral health services.",
        "I provide trainings in motivational interviewing, integrated primary care, harm reduction, working with LGBTQ clients, recovery coaching, and ethics.",
        "Research and Professional Service",
        "have conducted research on health psychology and health behavior change. One area of interest is adjustment to  and coping with chronic illness. You can see some of my published work here.",
        "I am very involved in doing research, writing, and service related to training mental health professionals to be competent in serving clients from diverse backgrounds.",
        "I have chaired and worked on the American Psychological Association Committee on Continuing Education to review and provide guidance on continuing education for psychologists.",
        "I worked with an incredible group of psychologists on issues surrounding values conflicts in mental health professional training programs. You can read more about that here and see a journal article I authored on the topic here.",
        "I am co-President of the Ithaca SEPTA, the special education PTA",
        "I serve on the Board of Directors of The Community Foundation of Tompkins County.",
        "Ph.D., Counseling Psychology, Virginia Commonwealth University, Richmond, VA, 2012",
        "M.S., Counseling Psychology, Virginia Commonwealth University, Richmond, VA",
        "M.S., Rehabilitation Counseling, Virginia Commonwealth University, Richmond, VA",
        "A.B., Comparative Literature and Women's Studies, Northampton, MA",
        "When not working, you can catch me sampling some good coffee, riding my lavender moped, or exploring playgrounds with my family!",
        "Ph.D., University of Akron, Counseling Psychology",
        "B.A., Baldwin-Wallace College",
        "Ph.D., Virginia Commonwealth University, Social Work",
        "M.S.W., Virginia Commonwealth University, Clinical Social Work",
        "B.A., Earlham College, Psychology",
        "Ph.D. (2014) North Carolina State University",
        "M.S. (2008) North Carolina State University",
        "B.A. (2001) University of Maine",
        "Introduction to Sociology",
        "Sociology of Health & Illness",
        "Health & the Family",
        "Global Perspectives on Health",
        "Feminism, Food, and Health",
        "Qualitative Research Methods",
        "Brains, Besties, and Bodies: Being a Woman in College (Ithaca First-Year Seminar)",
        "Research Areas",
        "Health & Illness",
        "Intersectionality",
        "Family",
        "Qualitative Methods",
        "Publications",
        "Book",
        "Bowen, Sarah, Joslyn Brenton and Sinikka Elliott. 2019. Pressure Cooker: Why Home Cooking Won't Solve Our Problems and What We Can Do About It. Oxford: Oxford University Press.",
        "Book Reviews",
        "The Atlantic: https://www.theatlantic.com/magazine/archive/2019/06/eat-food-all-the-time-mostly-junk/588052/",
        "Pacific Standard: https://psmag.com/magazine/the-limits-of-home-cooking",
        "Gastronimica: https://gcfs.ucpress.edu/content/19/3/96",
        "Food, Culture & Society : https://www.tandfonline.com/doi/abs/10.1080/15528014.2019.1658155?journalCode=rffc20",
        "Peer-Reviewed Articles",
        "Elliott, Sinikka, Joslyn Brenton, and Rachel Powell. 2018. “Brothermothering: Gender, Power, and the Parenting Strategies of Low-Income Black Single Mothers of Teenagers.” Social Problems 65(4): 439-455.",
        "Brenton, Joslyn. 2017. “The Limits of Intensive Feeding: Maternal Foodwork at the Intersections of Race, Class, and Gender.” Sociology of Health & Illness 39(6): 863-877.",
        "Elliott, Sinikka, Rachel Powell, and Joslyn Brenton. 2015. “Being a Good Mom: Low-Income Black Single Mothers Negotiate Intensive Mothering.” Journal of Family Issues 36(3): 351:370.",
        "Bowen, Sarah, Sinikka Elliott, and Joslyn Brenton. 2014. \"The Joy of Cooking?\" Contexts. http://ctx.sagepub.com/content/13/3/20.full",
        "Brenton, Joslyn and Sinikka Elliott. 2014. \"Undoing Gender? The Case of Complementary and Alternative Medicine.\" Sociology of Health and Illness 36(1): 91-107.",
        "Select Media",
        "Print News",
        "The Atlantic: https://www.theatlantic.com/family/archive/2019/03/pressure-cooker-home-cooked-meal/583876/",
        "Civil Eats: https://civileats.com/2019/03/01/more-time-in-the-kitchen-may-not-be-the-answer-to-feeding-kids-well/",
        "Pacific Standard: https://psmag.com/magazine/the-limits-of-home-cooking",
        "The Guardian: https://www.theguardian.com/profile/joslyn-brenton",
        "New York Times: http://op-talk.blogs.nytimes.com/2014/09/08/when-family-dinner-doesnt-satisfy/?_php=true&_type=blogs&_r=0",
        "Slate: http://www.slate.com/blogs/xx_factor/2014/09/03/home_cooked_family_dinners_a_major_burden_for_working_mothers.html",
        "PBS Newshour: http://www.pbs.org/newshour/rundown/study-finds-home-cooking-disproportionately-burdens-mothers/",
        "Radio / Podcast",
        "GRAVY: https://www.southernfoodways.org/gravy/home-cooked-expectations-dinner-under-pressure/",
        "Radio New Zealand: https://www.radionz.co.nz/national/programmes/sunday/audio/2018681841/myths-around-family-bonding",
        "The Oxford Comment: https://soundcloud.com/oupacademic/the-politics-of-food-episode-50-the-oxford-comment",
        "--A Long Slow Climb, 2021, three sections entitled Inferno, Purgatory, and Paradise, twenty-one sonnets in each section whose inspiration is Dante's Divine Comedy",
        "--elisions, 2019, four sections entitled Desire, Knowledge, Compassion, and Time, eleven poems each, all composed of multiple haiku stanzas",
        "--What May Be Lost, 2014, meditative prose poems on a variety of topics",
        "My first collection, A Warm Trend, Swallow's Tale Press, won a national manuscript competition in 1989.",
        "My poems have appeared in Bomb, december, Cloudbank, Bellevue Literary Review, The Chattahoochee Review, Mudfish, West Branch, Northwest Review, Postmodern Culture, The Fiddlehead, Arroyo Literary Review, The Antigonish Review, The Pedestal, Rosebud, Nimrod International Journal, and Sentence: a Journal of Prose Poetics.",
        "In 2023, a poem of mine won runner-up in LitMag's Anton Chekhov flash fiction contest--that publication is forthcoming.",
        "Areas",
        "poetry writing",
        "essay writing",
        "literary and creative writing theory",
        "intellectual history",
        "Degrees",
        "M.F.A. Poetry, Cornell University, 1984",
        "B.A. English and Philosophy, Oklahoma State University, 1979",
        "Poetry Books",
        "A Long Slow Climb, Cayuga Lake Books. 2021.",
        "elisions, Cayuga Lake Books. 2019.",
        "What May Be Lost, Cayuga Lake Books. 2014",
        "Poems, 1986-1998, Water Street Press. 2003.",
        "A Warm Trend, Swallow's Tale Press, winner of their national poetry manuscript contest. 1989.",
        "Interview on A Long Slow Climb",
        "https://cayugalakebooks.com/cory-brown-2/",
        "Review of elisions",
        "http://www.americanmicroreviews.com/elisions-by-cory-brown",
        "Some Journal Publications",
        "Poems",
        "Oberon poetry magazine, \"Out in the Deep,\" honorable mention 2024 poetry competition: https://www.oberonpoetry.com/new-page), forthcoming",
        "LitMag (2023, \"Giant Sequoias\"--runner-up in the Anton Chekhov Award for flash fiction)",
        "Mudfish 24 (2023, \"Boomerang\")",
        "Mudfish 23 (2023, \"What We Know\")",
        "Nimrod International Journal of Prose and Poetry (2023, \"What I'd Thought\" and \"To Live\")",
        "The Comstock Review (2023, \"Something Strange\")",
        "Cloudbank 16 (2022, \"But Here's the Thing\")",
        "Cloudbank 15 (2021, \"On the Terrace of the Wrathful\" and \"On the Terrace of the Envious\")",
        "From the Fingerlakes: A Memoir Anthology (2021, \"When I am Asked\" and \"The Verbalist\")",
        "Bellevue Literary Review 40 (2021, \"To See How the Snow Blanketed the Trees\")",
        "december magazine (2021, \"Friday the 13th\")",
        "Alluvian, (2019, \"Learning\")",
        "Reflecting Pool: Poets and the Creative Process. Codhill Press (2018, \"The Most Difficult Thought\" and \"Experience-Dependent Neuroplasticity\")",
        "Crosswinds Poetry Journal (2018, \"The Tyranny of Narrative\")",
        "Arroyo Literary Review (2011, \"Bats\" and \"Cool Hand Luke\")",
        "The Fiddlehead (2011, \"Traffic\"; 2008, \"Memory\")",
        "Nimrod International Journal of Prose and Poetry (2011, \"Not Yet\"; 2008, \"Dream\")",
        "The Antigonish Review (2011, \"Fairgrounds\" and \"The Nazi Helmet\"; 2007, \"The Heifer\" and \"Storm Cellar\")",
        "Sentence: a Journal of Prose Poetics (2010, \"Ghosts\")",
        "Postmodern Culture (volume 6 #2: \"Early Spring\" and \"Equinox\"; volume 6 #3: \"My Name in Water,\" \"Adumbration,\" \"Offering,\" and \"Depth Perception\"; volume 8#1: \"First Communion,\" \"There Was a Time,\" \"Summer Question,\" and \"Stars of Desire\")",
        "Farmer's Market (vol.10 no.2, 1994, \"Rhetoric of Senses\")",
        "Bomb (1995, issue 51: \"Kneeling at the Edge,\" a suite of poems)",
        "Bomb (1992, issue 40: \"Fireflies,\" \"All Yours,\" and \"Nature of the Sun\")",
        "Pedestal Magazine (\"Ars Poetica\")",
        "Essays",
        "Journal of Narrative Politics, summer 2022 (\"A Body in Time: Thoughts on the Effects of Change\")",
        "Proceedings for the Conference on Arts, Humanities, Social Sciences & Education, 2019 (\"The Ultimate Goal: Reflections on the Philosophy and Science of the Pursuit of Happiness\")",
        "Writing on the Edge, spring 2018 (\"The Sick Rose: Some Problems with the Self\")",
        "Journal of Narrative Politics, fall 2016 (\"Brutality of Desire\")",
        "Narrative Global Politics: Theory, History and the Personal in International Relations, Routledge, 2016 (\"Dancing Modernity\")",
        "Journal of Narrative Politics, spring 2016 (\"Thoughts on the Metaphysics of American White Racism\")",
        "South Loop Review, 2013 (\"Compliance: Death and Dying in America\"--this essay was a finalist in Missouri Review's 2013 essay competition)",
        "NCIIA Conference Proceedings, 2010 (\"Sustainability Maximizes Innovation: the use of life cycle assessment tools to enhance the design process\"--this essay was co-written with design theorist Xanthe Matychak. It was presented at two conferences: in 2012, the 16th annual National Collegiate Inventors and Innovators Alliance, San Francisco, California; and in 2010, the American Anthropological Association's annual conference, New Orleans, Louisiana.)",
        "Diner, 2007 (\"On Thinking: Deconstructing What There Is To Think About\")",
        "The International Journal of Technology, Knowledge, and Society, 2006 (\"Notes on the Role of the Arts in a Technocratic Culture\"--I presented this essay at two conferences: The 2nd International Conference on Technology, Knowledge, and Society, in Hyderabad, India; and the 22nd Annual Meeting of the International Association for Science, Technology and Society, in Baltimore.)",
        "Academic Writing",
        "Personal Essay",
        "Argument",
        "Women’s, Gender, and Sexuality Studies",
        "Queer Studies",
        "Extraordinary Bodies",
        "Women's Work: Gender and Labor",
        "Women and Society",
        "Feminist Theory",
        "You Are Where You Live",
        "Why Did I Get This Grade? Labor, Learning, and What We Value",
        "Rachel Fomalhaut received her PhD in English, General Literature, and Rhetoric from Binghamton University. Their dissertation explores the affective representation of loss in multicultural women’s fiction, and includes a framework for affective pedagogy. Fomalhaut's work has been published as book chapters in Real-Life Writers: Composition Courses as Pathways for Student Success and The Oracle of the “tiny finger snap of time”: A Study of Novels with a Specific Time Culture. She has organized and moderated panels and presented papers at numerous national and regional conferences.",
        "Fomalhaut served as co-founding Chair of the Ithaca College Contingent Faculty Union from 2017 - 2020. She continues to serve as a union steward working to improve faculty labor conditions in higher education, in deep awareness that teachers' working conditions are students' learning conditions."
    ]
}